MeisterBob/nrf52_zigbee_dongle/sdk/zigbee_helpers.c
/**
 * Copyright (c) 2018 - 2020, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */

#include <stdio.h>
#include <ctype.h>
#include <stddef.h>

#include "zigbee_helpers.h"
#include "zb_error_handler.h"
#include "zboss_api.h"
#include "nrf_gpio.h"
#include "nrf_log.h"
#include "boards.h"
#include "nrfx_power.h"

#ifdef BOARD_PCA10056
#define ERASE_PIN    NRF_GPIO_PIN_MAP(1,9)                                          /**< Pin 1.09. */
#endif
#ifdef BOARD_PCA10059
#define ERASE_PIN    NRF_GPIO_PIN_MAP(1,6)                                          /**< Pin 1.06. */
#endif
#ifdef BOARD_PCA10100
#define ERASE_PIN    NRF_GPIO_PIN_MAP(1,6)                                          /**< Pin 1.06. */
#endif
#define READ_RETRIES 10                                                             /**< Number of retries until the pin value stabilizes. */

#ifndef ZB_DEV_REJOIN_TIMEOUT_MS
#define ZB_DEV_REJOIN_TIMEOUT_MS (1000 * 200)                                       /**< Timeout after which End Device stops to send beacons if can not join/rejoin a network. */
#endif
#define REJOIN_INTERVAL_MAX_S    (15 * 60)                                          /**< Maximum interval between join/rejoin attempts. */

#define RAM_START_ADDRESS           0x20000000UL                                    /**< Start address of RAM. */
#define RAM_BANK_0_7_SECTION_SIZE   0x1000                                          /**< Size of RAM section for banks 0-7. */
#define RAM_BANK_0_7_SECTIONS_NBR   2                                               /**< Number of sections in banks 0-7. */
#define RAM_BANK_8_SECTION_SIZE     0x8000                                          /**< Size of RAM section for bank 8. */
#define RAM_BANK_8_SECTIONS_NBR     6                                               /**< Number of sections in bank 8. */

/* Define address of RAM region which can be used by application.
 * GCC, SES compiler and Keil compiler has memory layout
 * with stack being placed at the end of the RAM.
 * For those compilers end of RAM can be determined by top of the stack.
 * IAR has different layout and address of end of RAM
 * is determined by linker symbol.
 */
#if defined ( __ICCARM__ )
#define RAM_END_ADDRESS ((uint32_t)&__ICFEDIT_region_RAM_end__)

extern char __ICFEDIT_region_RAM_end__;
#else
#define RAM_END_ADDRESS ((uint32_t)STACK_TOP)
#endif /* defined __ICCARM__ */

static zb_uint8_t           m_stack_initialised             = ZB_FALSE;
static zb_uint8_t           m_is_rejoin_procedure_started   = ZB_FALSE;
static zb_uint8_t           m_is_rejoin_stop_requested      = ZB_FALSE;
static zb_uint8_t           m_is_rejoin_in_progress         = ZB_FALSE;
static zb_uint8_t           m_rejoin_attempt_cnt            = 0;
#if defined ZB_ED_ROLE
static volatile zb_uint8_t  m_wait_for_user_input           = ZB_FALSE;
static volatile zb_uint8_t  m_is_rejoin_start_scheduled     = ZB_FALSE;
#endif

extern char log_buf[256];

static void rejoin_the_network(zb_uint8_t param);
static void start_network_rejoin(void);
static void stop_network_rejoin(zb_uint8_t was_scheduled);

/**@brief Function to set the Erase persistent storage depending on the erase pin
 */
zb_void_t zigbee_erase_persistent_storage(zb_bool_t erase)
{
#if defined (BOARD_PCA10056) || defined (BOARD_PCA10059) || defined (BOARD_PCA10100)
    if (!erase)
    {
        nrf_gpio_cfg_input(ERASE_PIN, NRF_GPIO_PIN_PULLUP);

        int i;
        volatile uint32_t pin_state;

        /* Read a few times to make sure the value in the register has been updated. */
        for (i = 0; i < READ_RETRIES; i++)
        {
            pin_state = nrf_gpio_pin_read(ERASE_PIN);
        }

        if (pin_state == 0)
        {
            erase = ZB_TRUE;
            NRF_LOG_INFO("Forcing flash erasure due to pin state");
        }

        nrf_gpio_cfg_default(ERASE_PIN);
    }
#endif
    zb_set_nvram_erase_at_start(erase);
}

int to_hex_str(char * p_out, uint16_t out_size,
                  const uint8_t * p_in, uint8_t in_size,
                  bool reverse)
{
    int bytes_written = 0;
    int status;
    int i = reverse ? in_size - 1 : 0;

    for (; in_size > 0; in_size--)
    {
        status = snprintf(p_out + bytes_written,
                          out_size - bytes_written,
                          "%02x", p_in[i]);
        if (status < 0)
        {
            return status;
        }

