MeisterBob/nrf52_zigbee_dongle/sdk/zigbee_helpers.c
        bytes_written += status;
        i += reverse ? -1 : 1;
    }

    return bytes_written;
}

int ieee_addr_to_str(char * p_str_buf, uint16_t buf_len, const zb_ieee_addr_t p_addr)
{
    return to_hex_str(p_str_buf, buf_len,
                      (const uint8_t *)p_addr, sizeof(zb_ieee_addr_t),
                      true);
}

uint8_t parse_hex_digit(const char c)
{
    uint8_t result = 0xff;

    if ((c >= '0') && (c <= '9'))
    {
        result = c - '0';
    }
    else if ((c >='a') && (c <= 'f'))
    {
        result = c - 'a' + 10;
    }
    else if ((c >='A') && (c <= 'F'))
    {
        result = c - 'A' + 10;
    }

    return result;
}

bool parse_hex_str(char const * p_in_str, uint8_t in_str_len,
                   uint8_t * p_out_buff, uint8_t out_buff_size,
                   bool reverse)
{
    uint8_t i     = 0;
    int8_t  delta = 1;

    // Skip 0x suffix if present.
    if ((in_str_len > 2) && (p_in_str[0] == '0') && (tolower(p_in_str[1]) == 'x'))
    {
        in_str_len -= 2;
        p_in_str += 2;
    }

    if (reverse)
    {
        p_in_str = p_in_str + in_str_len - 1;
        delta    = -1;
    }

    // Check if we have enough output space
    if (in_str_len > 2*out_buff_size)
    {
        return false;
    }

    memset(p_out_buff, 0, out_buff_size);

    while (i < in_str_len)
    {
        uint8_t nibble = parse_hex_digit(*p_in_str);
        if (nibble > 0x0f)
        {
            break;
        }

        if (i & 0x01)
        {
            *p_out_buff |= reverse ? nibble << 4 : nibble;
            p_out_buff++;
        }
        else
        {
            *p_out_buff = reverse ? nibble : nibble << 4;
        }

        i += 1;
        p_in_str += delta;
    }

    return (i == in_str_len);
}

addr_type_t parse_address(const char * input, zb_addr_u * addr, addr_type_t addr_type)
{
    addr_type_t result = ADDR_INVALID;
    size_t      len    = strlen(input);

    if (!input || !addr || !strlen(input))
    {
        return ADDR_INVALID;
    }

    // Skip 0x suffix if present.
    if ((input[0] == '0') && (tolower(input[1]) == 'x'))
    {
        input += 2;
        len   -= 2;
    }

    if ((len == 2 * sizeof(zb_ieee_addr_t)) &&
        (addr_type == ADDR_ANY || addr_type == ADDR_LONG))
    {
        result = ADDR_LONG;
    }
    else if ((len == 2 * sizeof(uint16_t)) &&
             (addr_type == ADDR_ANY || addr_type == ADDR_SHORT))
    {
        result = ADDR_SHORT;
    }
    else
    {
        return ADDR_INVALID;
    }

    return parse_hex_str(input, len, (uint8_t *)addr, len / 2, true) ? result : ADDR_INVALID;
}

zb_ret_t zigbee_default_signal_handler(zb_bufid_t bufid)
{
    zb_zdo_app_signal_hdr_t  * p_sg_p      = NULL;
    zb_zdo_app_signal_type_t   sig         = zb_get_app_signal(bufid, &p_sg_p);
    zb_ret_t                   status      = ZB_GET_APP_SIGNAL_STATUS(bufid);
    zb_nwk_device_type_t       role        = zb_get_network_role();
    zb_ret_t                   ret_code    = RET_OK;
    zb_bool_t                  comm_status = ZB_TRUE;

    if (0) {
        const uint8_t *begin = zb_buf_begin(bufid);
        size_t len = zb_buf_len(bufid);
        // uint8_t data[len+1];
        // data[len] = 0x0;
        // memcpy(data, begin, len);
         sprintf(log_buf, "data (%d):", len);
        for (int i=0;i<len;i++)
            sprintf(log_buf, "%s%02x", log_buf, begin[i]);
        NRF_LOG_INFO("%s", log_buf);
        NRF_LOG_HEXDUMP_INFO(begin, len);
    }

    switch(sig)
    {
        case ZB_ZDO_SIGNAL_PRODUCTION_CONFIG_READY:
            /* At this point Zigbee stack attempted to load production configuration from NVRAM.
             * This step is performed each time the stack is initialized.
             *
             * Note: if it is necessary for a device to have a valid production configuration to operate (e.g. due to legal reasons),
             *       the application should implement the customized logic for this signal (e.g. assert on the signal status code).
             */
            if (status != RET_OK)
            {
                NRF_LOG_INFO("Production configuration is not present or invalid (status: %d)", status);
            }
            else
            {
                zb_production_config_ver_1_t *prod_conf = ZB_ZDO_SIGNAL_GET_PARAMS(p_sg_p, zb_production_config_ver_1_t);
                char ieee_addr_buf[17] = {0};
                int  addr_len;

                NRF_LOG_INFO("Loading application production config");

                /* IEEE address is automatically parsed and set by the ZBOSS stack. */
                addr_len = ieee_addr_to_str(ieee_addr_buf, sizeof(ieee_addr_buf), prod_conf->extended_address);
                if (addr_len < 0)
                {
                    strcpy(ieee_addr_buf, "unknown");
                }
                NRF_LOG_INFO("\tIEEE address: %s", NRF_LOG_PUSH(ieee_addr_buf));

                /* Channel mask has to be parsed and applied manually. */
                zb_set_bdb_primary_channel_set(prod_conf->aps_channel_mask);
                zb_set_bdb_secondary_channel_set(prod_conf->aps_channel_mask);
                NRF_LOG_INFO("\tChannel mask %08lx", prod_conf->aps_channel_mask);

                NRF_LOG_INFO("Production configuration successfully loaded");
            }
            break;

        case ZB_ZDO_SIGNAL_SKIP_STARTUP:
            /* At this point Zigbee stack:
             *  - Initialized the scheduler.
             *  - Initialized and read NVRAM configuration.
             *  - Initialized all stack-related global variables.
             *
             * Next step: perform BDB initialization procedure (see BDB specification section 7.1).
             */
            m_stack_initialised = ZB_TRUE;
            NRF_LOG_INFO("Zigbee stack initialized");
            comm_status = bdb_start_top_level_commissioning(ZB_BDB_INITIALIZATION);
            break;

