MeisterBob/nrf52_zigbee_dongle/sdk/zigbee_helpers.c
        case ZB_BDB_SIGNAL_DEVICE_FIRST_START:
            /* At this point Zigbee stack is ready to operate and the BDB initialization procedure has finished.
             * There is no network configuration stored inside NVRAM.
             *
             * Next step:
             *  - If the device implements Zigbee router or Zigbee end device,
             *    perform network steering for a node not on a network (see BDB specification section 8.3).
             *  - If the device implements Zigbee coordinator,
             *    perform network formation (see BDB specification section 8.4).
             */
            NRF_LOG_INFO("Device started for the first time");
            if (status == RET_OK)
            {
                if (role != ZB_NWK_DEVICE_TYPE_COORDINATOR)
                {
                    NRF_LOG_INFO("Start network steering");
                    start_network_rejoin();
                }
                else
                {
                    NRF_LOG_INFO("Start network formation");
                    comm_status = bdb_start_top_level_commissioning(ZB_BDB_NETWORK_FORMATION);
                }
            }
            else
            {
                NRF_LOG_ERROR("Failed to initialize Zigbee stack (status: %d)", status);
            }
            break;

        case ZB_BDB_SIGNAL_DEVICE_REBOOT:
            /* At this point Zigbee stack is ready to operate and the BDB initialization procedure has finished.
             * There is network configuration stored inside NVRAM, so the device will try to rejoin.
             *
             * Next step: if the device implement Zigbee router or end device, and the initialization has failed,
             *            perform network steering for a node on a network (see BDB specification section 8.2).
             */
            if (status == RET_OK)
            {
                zb_ext_pan_id_t extended_pan_id;
                char ieee_addr_buf[17] = {0};
                int  addr_len;

                zb_get_extended_pan_id(extended_pan_id);
                addr_len = ieee_addr_to_str(ieee_addr_buf, sizeof(ieee_addr_buf), extended_pan_id);
                if (addr_len < 0)
                {
                    strcpy(ieee_addr_buf, "unknown");
                }

                /* Device has joined the network so stop the network rejoin procedure. */
                stop_network_rejoin(ZB_FALSE);
                NRF_LOG_INFO("Joined network successfully on reboot signal (Extended PAN ID: %s, PAN ID: 0x%04hx)", NRF_LOG_PUSH(ieee_addr_buf), ZB_PIBCACHE_PAN_ID());
            }
            else
            {
                if (role != ZB_NWK_DEVICE_TYPE_COORDINATOR)
                {
                    NRF_LOG_INFO("Unable to join the network, start network steering");
                    start_network_rejoin();
                }
                else
                {
                    NRF_LOG_ERROR("Failed to initialize Zigbee stack using NVRAM data (status: %d)", status);
                }
            }
            break;

        case ZB_BDB_SIGNAL_STEERING:
            /* At this point the Zigbee stack has finished network steering procedure.
             * The device may have rejoined the network, which is indicated by signal's status code.
             *
             * Next step:
             *  - If the device implements Zigbee router and the steering is not successful,
             *    retry joining Zigbee network by starting network steering after 1 second.
             *  - It is not expected to finish network steering with error status if the device implements Zigbee coordinator (see BDB specification section 8.2).
             */
            if (status == RET_OK)
            {
                zb_ext_pan_id_t extended_pan_id;
                char ieee_addr_buf[17] = {0};
                int  addr_len;

                zb_get_extended_pan_id(extended_pan_id);
                addr_len = ieee_addr_to_str(ieee_addr_buf, sizeof(ieee_addr_buf), extended_pan_id);
                if (addr_len < 0)
                {
                    strcpy(ieee_addr_buf, "unknown");
                }

                NRF_LOG_INFO("Joined network successfully (Extended PAN ID: %s, PAN ID: 0x%04hx)", NRF_LOG_PUSH(ieee_addr_buf), ZB_PIBCACHE_PAN_ID());

                /* Device has joined the network so stop the network rejoin procedure. */
                if (role != ZB_NWK_DEVICE_TYPE_COORDINATOR)
                {
                    stop_network_rejoin(ZB_FALSE);
                }
            }
            else
            {
                if (role != ZB_NWK_DEVICE_TYPE_COORDINATOR)
                {
                    NRF_LOG_INFO("Network steering was not successful (status: %d)", status);
                    start_network_rejoin();
                }
                else
                {
                    NRF_LOG_INFO("Network steering failed on Zigbee coordinator (status: %d)", status);
                }
            }
#ifndef ZB_ED_ROLE
            zb_enable_auto_pan_id_conflict_resolution(ZB_FALSE);
#endif
            break;

        case ZB_BDB_SIGNAL_FORMATION:
            /* At this point the Zigbee stack has finished network formation procedure.
             * The device may have created a new Zigbee network, which is indicated by signal's status code.
             *
             * Next step:
             *  - If the device implements Zigbee coordinator and the formation is not successful,
             *    try to form a new Zigbee network by performing network formation after 1 second (see BDB specification section 8.4).
             *  - If the network formation was successful, open the newly created network for other devices to join by starting
             *    network steering for a node on a network (see BDB specification section 8.2).
             *  - If the device implements Zigbee router or end device, this signal is not expected.
             */
            if (status == RET_OK)
            {
                zb_ext_pan_id_t extended_pan_id;
                char ieee_addr_buf[17] = {0};
                int  addr_len;

