MeisterBob/nrf52_zigbee_dongle/sdk/zigbee_helpers.c
                zb_get_extended_pan_id(extended_pan_id);
                addr_len = ieee_addr_to_str(ieee_addr_buf, sizeof(ieee_addr_buf), extended_pan_id);
                if (addr_len < 0)
                {
                    strcpy(ieee_addr_buf, "unknown");
                }

                NRF_LOG_INFO("Network formed successfully, start network steering (Extended PAN ID: %s, PAN ID: 0x%04hx)", NRF_LOG_PUSH(ieee_addr_buf), ZB_PIBCACHE_PAN_ID());
                comm_status = bdb_start_top_level_commissioning(ZB_BDB_NETWORK_STEERING);
            }
            else
            {
                NRF_LOG_INFO("Restart network formation (status: %d)", status);
                ret_code = ZB_SCHEDULE_APP_ALARM(
                                   (zb_callback_t)bdb_start_top_level_commissioning,
                                   ZB_BDB_NETWORK_FORMATION,
                                   ZB_TIME_ONE_SECOND
                               );
            }
            break;

        case ZB_ZDO_SIGNAL_LEAVE:
            /* This signal is generated when the device itself has left the network by sending leave command.
             *
             * Note: this signal will be generated if the device tries to join legacy Zigbee network and the TCLK
             *       exchange cannot be completed. In such situation, the ZB_BDB_NETWORK_STEERING signal will be generated
             *       afterwards, so this case may be left unimplemented.
             */
            if (status == RET_OK)
            {
                zb_zdo_signal_leave_params_t * p_leave_params = ZB_ZDO_SIGNAL_GET_PARAMS(p_sg_p, zb_zdo_signal_leave_params_t);
                NRF_LOG_INFO("Network left (leave type: %d)", p_leave_params->leave_type);

                /* Start network rejoin procedure */
                start_network_rejoin();
            }
            else
            {
                NRF_LOG_ERROR("Unable to leave network (status: %d)", status);
            }
#ifndef ZB_ED_ROLE
            zb_enable_auto_pan_id_conflict_resolution(ZB_FALSE);
#endif
            break;

        case ZB_ZDO_SIGNAL_LEAVE_INDICATION:
            /* This signal is generated on the parent to indicate, that one of its child nodes left the network.
             */
            {
                zb_zdo_signal_leave_indication_params_t * p_leave_ind_params = ZB_ZDO_SIGNAL_GET_PARAMS(p_sg_p, zb_zdo_signal_leave_indication_params_t);
                char ieee_addr_buf[17] = {0};
                int  addr_len;

                addr_len = ieee_addr_to_str(ieee_addr_buf, sizeof(ieee_addr_buf), p_leave_ind_params->device_addr);
                if (addr_len < 0)
                {
                    strcpy(ieee_addr_buf, "unknown");
                }
                NRF_LOG_INFO("Child left the network (long: %s, rejoin flag: %d)", NRF_LOG_PUSH(ieee_addr_buf), p_leave_ind_params->rejoin);
            }
            break;

#ifdef ZB_ED_ROLE
        case ZB_COMMON_SIGNAL_CAN_SLEEP:
            /* Zigbee stack can enter sleep state.
             * If the application wants to proceed, it should call zb_sleep_now() function.
             *
             * Note: if the application shares some resources between Zigbee stack and other tasks/contexts,
             *       device disabling should be overwritten by implementing one of the weak functions inside zb_nrf52840_common.c.
             */
            zb_sleep_now();
            break;
#endif

        case ZB_ZDO_SIGNAL_DEVICE_UPDATE:
            /* This signal notifies the Zigbee Trust center (usually implemented on the coordinator node)
             * or parent router application once a device joined, rejoined, or left the network.
             *
             * For more information see table 4.14 of the Zigbee Specification (R21).
             */
            {
                zb_zdo_signal_device_update_params_t * p_update_params = ZB_ZDO_SIGNAL_GET_PARAMS(p_sg_p, zb_zdo_signal_device_update_params_t);
                char ieee_addr_buf[17] = {0};
                int  addr_len;

                addr_len = ieee_addr_to_str(ieee_addr_buf, sizeof(ieee_addr_buf), p_update_params->long_addr);
                if (addr_len < 0)
                {
                    strcpy(ieee_addr_buf, "unknown");
                }
                NRF_LOG_INFO("Device update received (short: 0x%04hx, long: %s, status: %d)",
                             p_update_params->short_addr, NRF_LOG_PUSH(ieee_addr_buf), p_update_params->status);
            }
            break;

        case ZB_ZDO_SIGNAL_DEVICE_ANNCE:
            /* This signal is generated when a Device Announcement command is received by the device.
             * Such packet is generated whenever a node joins or rejoins the network, so this signal may be used to track the number of devices.
             *
             * Note: since the Device Announcement command is sent to the broadcast address, this method may miss some devices.
             *       The complete knowledge about nodes has only the coordinator.
             *
             * Note: it may happen, that a device broadcasts the Device Announcement command and is removed by the coordinator afterwards,
             *       due to security policy (lack of TCLK exchange).
             */
            {
                char node_buf[17];
                const uint8_t *begin = zb_buf_begin(bufid);
                size_t len = zb_buf_len(bufid);
                log_buf[0] = 0x0;
                for (int i=3;i<len-1;i++)
                    sprintf(log_buf, "%s%02x", log_buf, begin[i]);
                zb_zdo_signal_device_annce_params_t * dev_annce_params = ZB_ZDO_SIGNAL_GET_PARAMS(p_sg_p, zb_zdo_signal_device_annce_params_t);
                ieee_addr_to_str(node_buf, sizeof(node_buf), dev_annce_params->ieee_addr);
                NRF_LOG_INFO("join nwk:0x%04hx ieee:%s cap:0x%02x frame:%s",
                    dev_annce_params->device_short_addr,
                    nrf_log_push(node_buf),
                    dev_annce_params->capability,
                    log_buf);
            }
            break;

#ifndef ZB_ED_ROLE
        case ZB_ZDO_SIGNAL_DEVICE_AUTHORIZED:
            /* This signal notifies the Zigbee Trust center application (usually implemented on the coordinator node)
             * about authorization of a new device in the network.
             *
             * For Zigbee 3.0 (and newer) devices this signal is generated if:
             *  - TCKL exchange procedure was successful
             *  - TCKL exchange procedure timed out
             *
             * If the coordinator allows for legacy devices to join the network (enabled by zb_bdb_set_legacy_device_support(1) API call),
             * this signal is generated:
             *  - If the parent router generates Update Device command and the joining device does not perform TCLK exchange within timeout.
             *  - If the TCLK exchange is successful.
             */
            {
                zb_zdo_signal_device_authorized_params_t * p_authorize_params = ZB_ZDO_SIGNAL_GET_PARAMS(p_sg_p, zb_zdo_signal_device_authorized_params_t);
                char ieee_addr_buf[17] = {0};
                int  addr_len;

                addr_len = ieee_addr_to_str(ieee_addr_buf, sizeof(ieee_addr_buf), p_authorize_params->long_addr);
                if (addr_len < 0)
                {
                    strcpy(ieee_addr_buf, "unknown");
                }
                NRF_LOG_INFO("Device authorization event received (short: 0x%04hx, long: %s, authorization type: %d, authorization status: %d)",
                             p_authorize_params->short_addr, NRF_LOG_PUSH(ieee_addr_buf),
                             p_authorize_params->authorization_type, p_authorize_params->authorization_status);
            }
            break;
#endif

