MeisterBob/nrf52_zigbee_dongle/sdk/zigbee_helpers.c
        case ZB_NWK_SIGNAL_NO_ACTIVE_LINKS_LEFT:
            /* This signal informs the application that all links to other routers has expired.
             * In such situation, the node can communicate only with its children.
             *
             * Example reasons of signal generation:
             *  - The device was brought too far from the rest of the network.
             *  - There was a power cut and the whole network suddenly disappeared.
             *
             * Note: This signal is not generated for the coordinator node, since it may operate alone
             *       in the network.
             */
            NRF_LOG_WARNING("Parent is unreachable");
            break;

        case ZB_BDB_SIGNAL_FINDING_AND_BINDING_TARGET_FINISHED:
            /* This signal informs the Finding & Binding target device that the procedure has finished
             * and the other device has been bound or the procedure timed out.
             */
            NRF_LOG_INFO("Find and bind target finished (status: %d)", status);
            break;

#ifndef ZB_ED_ROLE
        case ZB_NWK_SIGNAL_PANID_CONFLICT_DETECTED:
            /* This signal informs the Router and Coordinator that conflict PAN ID has been detected
             * and needs to be resolved. In order to do that *zb_start_pan_id_conflict_resolution* is called.
             */
            {
                NRF_LOG_INFO("PAN ID conflict detected, trying to resolve... ");

                zb_bufid_t buf_copy = zb_buf_get_out();
                if (buf_copy)
                {
                    zb_buf_copy(buf_copy, bufid);
                    ZVUNUSED(ZB_ZDO_SIGNAL_CUT_HEADER(buf_copy));

                    zb_start_pan_id_conflict_resolution(buf_copy);
                }
                else
                {
                    NRF_LOG_ERROR("No free buffer available, skipping conflict resolving this time.")
                }
            }
            break;
#endif

        case ZB_ZDO_SIGNAL_DEFAULT_START:
        case ZB_NWK_SIGNAL_DEVICE_ASSOCIATED:
            /* Obsolete signals, used for pre-R21 ZBOSS API. Ignore. */
            break;

        default:
            /* Unimplemented signal. For more information see: zb_zdo_app_signal_type_e and zb_ret_e. */
            NRF_LOG_INFO("Unimplemented signal (signal: %d, status: %d)", sig, status);
            break;
    }

    /* If configured, process network rejoin procedure. */
    rejoin_the_network(0);

    if ((ret_code == RET_OK) && (comm_status != ZB_TRUE))
    {
        ret_code = RET_ERROR;
    }

    return ret_code;
}

void zigbee_led_status_update(zb_bufid_t bufid, uint32_t led_idx)
{
    zb_zdo_app_signal_hdr_t  * p_sg_p = NULL;
    zb_zdo_app_signal_type_t   sig    = zb_get_app_signal(bufid, &p_sg_p);
    zb_ret_t                   status = ZB_GET_APP_SIGNAL_STATUS(bufid);

    switch (sig)
    {
        case ZB_BDB_SIGNAL_DEVICE_REBOOT:
            /* fall-through */
        case ZB_BDB_SIGNAL_STEERING:
            if (status == RET_OK)
            {
                bsp_board_led_on(led_idx);
            }
            else
            {
                bsp_board_led_off(led_idx);
            }
            break;

        case ZB_ZDO_SIGNAL_LEAVE:
            /* Update network status LED */
            bsp_board_led_off(led_idx);
            break;

        default:
            break;
    }
}

/**@brief Start network steering.
 */
static void start_network_steering(zb_uint8_t param)
{
    ZVUNUSED(param);
    ZVUNUSED(bdb_start_top_level_commissioning(ZB_BDB_NETWORK_STEERING));
}

/**@brief Process rejoin procedure. To be called in signal handler.
 */
static void rejoin_the_network(zb_uint8_t param)
{
    ZVUNUSED(param);

    if (m_stack_initialised && m_is_rejoin_procedure_started)
    {
        if (m_is_rejoin_stop_requested)
        {
            m_is_rejoin_procedure_started = ZB_FALSE;
            m_is_rejoin_stop_requested = ZB_FALSE;

#if defined ZB_ED_ROLE
            NRF_LOG_INFO("Network rejoin procedure stopped as %sscheduled.", (m_wait_for_user_input) ? "" : "NOT ");
#elif defined ZB_ROUTER_ROLE
            NRF_LOG_INFO("Network rejoin procedure stopped.");
#endif
        }
        else if (!m_is_rejoin_in_progress)
        {
            /* Calculate new timeout */
            zb_time_t timeout_s;
            if ((1 << m_rejoin_attempt_cnt) > REJOIN_INTERVAL_MAX_S)
            {
                timeout_s = REJOIN_INTERVAL_MAX_S;
            }
            else
            {
                timeout_s = (1 << m_rejoin_attempt_cnt);
                m_rejoin_attempt_cnt++;
            }

            zb_ret_t zb_err_code = ZB_SCHEDULE_APP_ALARM(start_network_steering, ZB_FALSE, ZB_MILLISECONDS_TO_BEACON_INTERVAL(timeout_s * 1000));
            ZB_ERROR_CHECK(zb_err_code);

            m_is_rejoin_in_progress= ZB_TRUE;
        }
    }
}

/**@brief Function for starting rejoin network procedure.
 *
 * @note  For Router device if stack is initialised, device is not joined
 *        and rejoin procedure is not running, start rejoin procedure.
 *
 * @note  For End Device if stack is initialised, rejoin procedure is not running,
 *        device is not joined and device is not waiting for the user input, start rejoin procedure.
 *        Additionally, schedule alarm to stop rejoin procedure after the timeout defined by ZB_DEV_REJOIN_TIMEOUT_MS.
 */
static void start_network_rejoin(void)
{
#if defined ZB_ED_ROLE
    if (!ZB_JOINED() && m_stack_initialised && !m_wait_for_user_input)
#elif defined ZB_ROUTER_ROLE
    if (!ZB_JOINED() && m_stack_initialised)
#endif
    {
        m_is_rejoin_in_progress         = ZB_FALSE;

        if (!m_is_rejoin_procedure_started)
        {
            m_is_rejoin_procedure_started   = ZB_TRUE;
            m_is_rejoin_stop_requested      = ZB_FALSE;
            m_is_rejoin_in_progress         = ZB_FALSE;
            m_rejoin_attempt_cnt            = 0;

#if defined ZB_ED_ROLE
            m_wait_for_user_input           = ZB_FALSE;
            m_is_rejoin_start_scheduled     = ZB_FALSE;

            zb_ret_t zb_err_code = ZB_SCHEDULE_APP_ALARM(stop_network_rejoin, ZB_TRUE, ZB_MILLISECONDS_TO_BEACON_INTERVAL(ZB_DEV_REJOIN_TIMEOUT_MS));
            ZB_ERROR_CHECK(zb_err_code);
#endif

            NRF_LOG_INFO("Started network rejoin procedure.");
        }
    }
}

/**@brief Function for stopping rejoin network procedure and related scheduled alarms.
 *
 * @param[in] was_scheduled   Zigbee flag to indicate if the function was scheduled or called directly.
 */
static void stop_network_rejoin(zb_uint8_t was_scheduled)
{
    /* For Router and End Device:
     *   Try to stop scheduled network steering. Stop rejoin procedure or if no network steering was scheduled,
     *   request rejoin stop on next rejoin_the_network() call.
     * For End Device only:
     *   If stop_network_rejoin() was called from scheduler, the rejoin procedure has reached timeout,
     *   set m_wait_for_user_input to ZB_TRUE so the rejoin procedure can only be started by calling user_input_indicate().
     *   If not, set m_wait_for_user_input to ZB_FALSE.
     */

    zb_ret_t zb_err_code;

#if defined ZB_ED_ROLE
    /* Set m_wait_for_user_input depending on if the device should retry joining on user_input_indication() */
    m_wait_for_user_input = was_scheduled;
#elif defined ZB_ROUTER_ROLE
    ZVUNUSED(was_scheduled);
#endif

    if (m_is_rejoin_procedure_started)
    {
        zb_err_code = ZB_SCHEDULE_APP_ALARM_CANCEL(start_network_steering, ZB_ALARM_ANY_PARAM);
        if (zb_err_code == RET_OK)
        {
            /* Stop rejoin procedure */
            m_is_rejoin_procedure_started = ZB_FALSE;
            m_is_rejoin_stop_requested = ZB_FALSE;
#if defined ZB_ED_ROLE
            NRF_LOG_INFO("Network rejoin procedure stopped as %sscheduled.", (m_wait_for_user_input) ? "" : "not ");
#elif defined ZB_ROUTER_ROLE
            NRF_LOG_INFO("Network rejoin procedure stopped.");
#endif
        }
        else
        {
            /* Request rejoin procedure stop */
            m_is_rejoin_stop_requested = ZB_TRUE;
        }
    }

#if defined ZB_ED_ROLE
    /* Make sure scheduled stop alarm is canceled. */
    zb_err_code = ZB_SCHEDULE_APP_ALARM_CANCEL(stop_network_rejoin, ZB_ALARM_ANY_PARAM);
    if (zb_err_code != RET_NOT_FOUND)
    {
        ZB_ERROR_CHECK(zb_err_code);
    }
#endif
}

#if defined ZB_ED_ROLE
/* Function to be scheduled when user_input_indicate() is called and m_wait_for_user_input is ZB_TRUE */
static void start_network_rejoin_ED(zb_uint8_t param)
{
    ZVUNUSED(param);
    if (!ZB_JOINED() && m_wait_for_user_input)
    {
        zb_ret_t zb_err_code;

        m_wait_for_user_input = ZB_FALSE;
        start_network_rejoin();

        zb_err_code = ZB_SCHEDULE_APP_ALARM(rejoin_the_network, 0, ZB_TIME_ONE_SECOND);
        ZB_ERROR_CHECK(zb_err_code);
    }
    m_is_rejoin_start_scheduled = ZB_FALSE;
}

