MeisterBob/nrf52_zigbee_dongle/sdk/zigbee_helpers.c
/* Function to be called by an application e.g. inside button handler function */
void user_input_indicate(void)
{
    if (m_wait_for_user_input && !(m_is_rejoin_start_scheduled))
    {
        zb_ret_t zb_err_code = RET_OK;

        zb_err_code = ZB_SCHEDULE_APP_CALLBACK(start_network_rejoin_ED, 0);
        ZB_ERROR_CHECK(zb_err_code);

        /* Prevent scheduling multiple rejoin starts */
        if (!zb_err_code)
        {
            m_is_rejoin_start_scheduled = ZB_TRUE;
        }
    }
}
#endif

/**@bried Calculate bottom addresss of RAM bank with given id.
 *
 * @param[in] bank_id  ID of RAM bank to get start address of.
 *
 * @return    Start address of RAM bank.
 */
static inline uint32_t ram_bank_bottom_addr(uint8_t bank_id)
{
    return RAM_START_ADDRESS + bank_id * RAM_BANK_0_7_SECTION_SIZE * RAM_BANK_0_7_SECTIONS_NBR;
}

/* Function for powering down unused RAM. */
void zigbee_power_down_unused_ram(void)
{
#if defined(NRF52811_XXAA) || defined(NRF52833_XXAA) || defined(NRF52840_XXAA)

    /* ID of top RAM bank */
#if defined(NRF52811_XXAA)
    uint8_t     bank_id                 = 3;
#elif defined(NRF52833_XXAA) || defined(NRF52840_XXAA)
    uint8_t     bank_id                 = 8;
#endif
    uint8_t     section_id              = 5;
    uint32_t    section_size            = 0;
    /* Mask to power down whole RAM bank */
    uint32_t    ram_bank_power_off_mask = 0xFFFFFFFF;

    /* Power off banks with unused RAM only */
    while (RAM_END_ADDRESS <= ram_bank_bottom_addr(bank_id))
    {
        NRF_LOG_DEBUG("Powering off bank: %d.", bank_id);
#ifdef SOFTDEVICE_PRESENT
        ret_code_t ret_val;

        ret_val = sd_power_ram_power_clr(bank_id, ram_bank_power_off_mask);
        APP_ERROR_CHECK(ret_val);
#else
        nrf_power_rampower_mask_off(bank_id, ram_bank_power_off_mask);
#endif /* defined SOFTDEVICE_PRESENT*/
        bank_id--;
    }

    /* Set id of top section and section size for given bank */
    section_id = (bank_id == 8) ? (RAM_BANK_8_SECTIONS_NBR - 1) : (RAM_BANK_0_7_SECTIONS_NBR - 1);
    section_size = (bank_id == 8) ? RAM_BANK_8_SECTION_SIZE : RAM_BANK_0_7_SECTION_SIZE;

    /* Power off remaining sections of unused RAM */
    while (RAM_END_ADDRESS <= (ram_bank_bottom_addr(bank_id) + section_id * section_size))
    {
        NRF_LOG_DEBUG("Powering off section %d of bank %d.", section_id, bank_id);
#ifdef SOFTDEVICE_PRESENT
        ret_code_t ret_val;

        ret_val = sd_power_ram_power_clr(bank_id, ((NRF_POWER_RAMPOWER_S0POWER << section_id) |
                                                   (NRF_POWER_RAMPOWER_S0RETENTION << section_id)));
        APP_ERROR_CHECK(ret_val);
#else
        nrf_power_rampower_mask_off(bank_id, ((NRF_POWER_RAMPOWER_S0POWER << section_id) |
                                              (NRF_POWER_RAMPOWER_S0RETENTION << section_id)));
#endif /* defined SOFTDEVICE_PRESENT*/

        section_id--;
    }

#else
#warning "Unsupported MCU - No RAM is powered down"
#endif /* defined NRF52811_XXAA || defined NRF52833_XXAA || defined NRF52840_XXAA */
}
